// 判断时间阶段。比如用户输入12点弹出中午好，用户输入18点弹出傍晚好，用户输入23点弹出深夜好。

// 凌晨(1:00-5:00)
// 早上(5:00-8:00)
// 上午(8:00-11:00)
// 中午(11:00-13:00)
// 下午(13:00-17:00)
// 晚上(17:00-19:00)
// 半夜(19:00-20:00)
// 深夜(20:00-24:00)

let time = prompt('请按24小时制输入时间：');

if ( time < 5 ) {
  alert('凌晨好！');
} else if (time < 8) {
  alert('早上好！');
} else if (time < 11) {
  alert('上午好！');
} else if (time < 13) {
  alert('中午好！');
} else if (time < 17) {
  alert('下午好！');
} else if (time < 19) {
  alert('晚上好！');
} else if (time < 20) {
  alert('半夜好！');
} else if (time <= 24) {
  alert('深夜好！');
} else {
  alert('请输入正确的时间');
}
